package task06;

//6. Написать программу нахождения суммы большего и меньшего из трех чисел.

public class Runner06 {
    public static void main(String[] args) {
        double a = 9;
        double b = 8;
        double c = -9;
        System.out.println("result = " + ClassForTask06.sumMinMax(a, b, c));
    }


}
